swak4Foam/Examples/decomposition/crazyDecompositionPitzDaily/system/decomposeParDict.redistribute.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  |-numberOfProcessors-|;

method  swak;

swakCoeffs {
    processorExpression "|-numberOfProcessors-1-|-cpuNr";
    mappingMethod round;
}

// ************************************************************************* //
